{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"name": "masking_1", "batch_input_shape": [null, 2000, 19], "dtype": "float32", "trainable": true, "mask_value": 0.0}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "units": 128, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null}}}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "merge_mode": "concat", "trainable": true, "layer": {"class_name": "LSTM", "config": {"return_sequences": true, "unroll": false, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_constraint": null, "implementation": 0, "units": 128, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "dropout": 0.0, "stateful": false, "use_bias": true, "return_state": false, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "recurrent_regularizer": null}}}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "merge_mode": "concat", "trainable": true, "layer": {"class_name": "LSTM", "config": {"return_sequences": true, "unroll": false, "name": "lstm_2", "bias_constraint": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_constraint": null, "implementation": 0, "units": 128, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "dropout": 0.0, "stateful": false, "use_bias": true, "return_state": false, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null, "recurrent_regularizer": null}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "layer": {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_2", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "units": 2, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null}}}}], "backend": "tensorflow", "keras_version": "2.0.6"}